# Pandas

### Pandas is one of the tools in Machine Learning 
### It is used for data cleaning and analysis. 
### Other features : Exploring, cleaning, transforming and visualizing from data. 
### Pandas is an open-source python package built on top of Numpy

In [1]:
import pandas as pd

In [2]:
a = pd.Series([1,2,3,4,5,6])
a

0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

In [3]:
type(a)

pandas.core.series.Series

In [4]:
# excessing elements form series
a[3]

4

In [5]:
a = pd.Series(['a','b','z'])
a

0    a
1    b
2    z
dtype: object

In [6]:
# Date index
date = pd.date_range(start='14-06-2000', end='25-06-2000')
date

DatetimeIndex(['2000-06-14', '2000-06-15', '2000-06-16', '2000-06-17',
               '2000-06-18', '2000-06-19', '2000-06-20', '2000-06-21',
               '2000-06-22', '2000-06-23', '2000-06-24', '2000-06-25'],
              dtype='datetime64[ns]', freq='D')

In [7]:
type(date)

pandas.core.indexes.datetimes.DatetimeIndex

## Pandas Dataframe

In [8]:
# creating array of data
name = ['Deepanshu','Gunjan','Vikrant','Amrita','Neha']

In [9]:
domain = ['AI/ML','Java','JS','Python','AI/ML']

In [10]:
experience = [3,2,4,1,3]

In [11]:
# creating dictonary from array
data = {'Name': name,
        'Domain':domain,
        'Experience':experience
}

In [12]:
# passing dictionary to DataFrame
df = pd.DataFrame(data)
df

        Name  Domain  Experience
0  Deepanshu   AI/ML           3
1     Gunjan    Java           2
2    Vikrant      JS           4
3     Amrita  Python           1
4       Neha   AI/ML           3

In [13]:
# zip function: take out values of particular index and make a tuple out of it

zipped = list(zip(name,domain,experience))
zipped

[('Deepanshu', 'AI/ML', 3),
 ('Gunjan', 'Java', 2),
 ('Vikrant', 'JS', 4),
 ('Amrita', 'Python', 1),
 ('Neha', 'AI/ML', 3)]

In [14]:
import numpy as np

In [15]:
a = np.random.random([5,4])
a

array([[0.62057268, 0.08936901, 0.44651501, 0.792717  ],
       [0.3984203 , 0.29995077, 0.08059778, 0.1135064 ],
       [0.13397739, 0.79315712, 0.5984734 , 0.41002087],
       [0.20771686, 0.99051143, 0.94621779, 0.47397083],
       [0.69325864, 0.45419995, 0.91970355, 0.97246402]])

In [16]:
df1 = pd.DataFrame(a) 
df1

          0         1         2         3
0  0.620573  0.089369  0.446515  0.792717
1  0.398420  0.299951  0.080598  0.113506
2  0.133977  0.793157  0.598473  0.410021
3  0.207717  0.990511  0.946218  0.473971
4  0.693259  0.454200  0.919704  0.972464

In [17]:
df1 = pd.DataFrame(data = a, columns='W X Y Z'.split(), index = 'A B C D E'.split())
df1

          W         X         Y         Z
A  0.620573  0.089369  0.446515  0.792717
B  0.398420  0.299951  0.080598  0.113506
C  0.133977  0.793157  0.598473  0.410021
D  0.207717  0.990511  0.946218  0.473971
E  0.693259  0.454200  0.919704  0.972464

In [18]:
# pick random numbers in between low and high and shape is given in size
val1 = np.random.randint(low =10,high=90,size=[20,])
val1

array([72, 72, 69, 54, 47, 89, 34, 25, 18, 21, 42, 52, 36, 52, 43, 65, 49,
       27, 86, 41])

In [19]:
# pick passed elements from the given list
val2 = np.random.choice(['Ansh','vans','veer','shiv'],20)
val2

array(['Ansh', 'vans', 'veer', 'veer', 'veer', 'Ansh', 'Ansh', 'vans',
       'shiv', 'veer', 'Ansh', 'vans', 'shiv', 'Ansh', 'Ansh', 'Ansh',
       'Ansh', 'shiv', 'vans', 'vans'], dtype='<U4')

In [20]:
zipped = list(zip(val1,val2))
zipped

[(72, 'Ansh'),
 (72, 'vans'),
 (69, 'veer'),
 (54, 'veer'),
 (47, 'veer'),
 (89, 'Ansh'),
 (34, 'Ansh'),
 (25, 'vans'),
 (18, 'shiv'),
 (21, 'veer'),
 (42, 'Ansh'),
 (52, 'vans'),
 (36, 'shiv'),
 (52, 'Ansh'),
 (43, 'Ansh'),
 (65, 'Ansh'),
 (49, 'Ansh'),
 (27, 'shiv'),
 (86, 'vans'),
 (41, 'vans')]

In [21]:
# creating dataframe
df = pd.DataFrame(data=zipped,columns=['Age','Name'])
df

    Age  Name
0    72  Ansh
1    72  vans
2    69  veer
3    54  veer
4    47  veer
5    89  Ansh
6    34  Ansh
7    25  vans
8    18  shiv
9    21  veer
10   42  Ansh
11   52  vans
12   36  shiv
13   52  Ansh
14   43  Ansh
15   65  Ansh
16   49  Ansh
17   27  shiv
18   86  vans
19   41  vans

In [22]:
type(df)

pandas.core.frame.DataFrame

In [23]:
#Default 5 top values
df.head()

   Age  Name
0   72  Ansh
1   72  vans
2   69  veer
3   54  veer
4   47  veer

In [24]:
df.head(2)

   Age  Name
0   72  Ansh
1   72  vans

In [25]:
#tail return last rows
df.tail()

    Age  Name
15   65  Ansh
16   49  Ansh
17   27  shiv
18   86  vans
19   41  vans

In [26]:
df.tail(3)

    Age  Name
17   27  shiv
18   86  vans
19   41  vans

In [27]:
#return shape
df.shape

(20, 2)

In [28]:
# return columns name and type (string is for objects)
df.columns

Index(['Age', 'Name'], dtype='object')

### Accessing DataFrame

In [29]:
df['Name'] # pass column name and will access that column

0     Ansh
1     vans
2     veer
3     veer
4     veer
5     Ansh
6     Ansh
7     vans
8     shiv
9     veer
10    Ansh
11    vans
12    shiv
13    Ansh
14    Ansh
15    Ansh
16    Ansh
17    shiv
18    vans
19    vans
Name: Name, dtype: object

In [30]:
df.info() # Will give you complete Dataframe information

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20 entries, 0 to 19
Data columns (total 2 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Age     20 non-null     int64
 1   Name    20 non-null     object
dtypes: int64(1), object(1)
memory usage: 448.0+ bytes

In [31]:
df.describe()

             Age
count  20.000000
mean   49.700000
std    20.606846
min    18.000000
25%    35.500000
50%    48.000000
75%    66.000000
max    89.000000

In [32]:
df.set_index('Name',inplace=True)
df

      Age
Name
Ansh   72
vans   72
veer   69
veer   54
veer   47
Ansh   89
Ansh   34
vans   25
shiv   18
veer   21
Ansh   42
vans   52
shiv   36
Ansh   52
Ansh   43
Ansh   65
Ansh   49
shiv   27
vans   86
vans   41

In [33]:
df.sort_index(axis=0, ascending=True)

      Age
Name
Ansh   72
Ansh   49
Ansh   65
Ansh   43
Ansh   89
Ansh   34
Ansh   52
Ansh   42
shiv   27
shiv   18
shiv   36
vans   41
vans   86
vans   25
vans   72
vans   52
veer   47
veer   54
veer   69
veer   21